1. Joining and merging

Test Data:

student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
student_data2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [1]:
import pandas as pd

student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

### Q1: Join the two given dataframes along rows and assign all data.

In [8]:
q1 = pd.concat([student_data1, student_data2])
q1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

### Q2: Join the two given dataframes along columns and assign all data.

In [9]:
q2 = pd.concat([student_data1, student_data2], axis = 1)
q2

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

### Q3: append rows to an STUDENT_1 and display the combined data
New Row(s)
student_id                  S6
name          Scarlette Fisher
marks                      205
dtype: object

In [6]:
new = pd.Series(['S6', 'Scarlette Fisher', 205], index = ['student_id', 'name', 'marks'])
q3 = student_data1.append(new, ignore_index = True)
q3

/var/folders/0m/hd5nyhdj19b3dcxl72fwby3c0000gn/T/ipykernel_16228/3389376688.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  q3 = student_data1.append(new, ignore_index = True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    205

### Q4: append a list of dictioneries or series to a existing DataFrame and display the combined data
Dictionary:
student_id                  S6
name          Scarlette Fisher
marks                      205
student_id                  S7
name              Bryce Jensen
marks                      207
dtype: object

In [7]:
dicts = [{'student_id': 'S6', 'name': 'Scarlette Fisher', 'marks': 205}, {'student_id':'S7', 'name': 'Bryce Jensen', 'marks':207}]
q4 = student_data1.append(dicts, ignore_index= True, sort = False)
q4

/var/folders/0m/hd5nyhdj19b3dcxl72fwby3c0000gn/T/ipykernel_16228/109534805.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  q4 = student_data1.append(dicts, ignore_index= True, sort = False)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    205
6         S7      Bryce Jensen    207

### Q5: join the two given dataframes along rows and merge with another dataframe along the common column id
exam_data:
   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

In [11]:


exam_data = pd.DataFrame({
    'student_id':['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
    'exam_id':[23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]
                          })
q5 = pd.merge(q1, exam_data, on = 'student_id')
q5

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

### Q6:join the two dataframes using the common column of both dataframes

In [12]:
q6 = pd.merge(student_data1, student_data2, on = 'student_id', how='inner')
q6

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

###   Q7:  join the two dataframes with matching records from both sides where available

In [13]:
q7 = pd.merge(student_data1, student_data2, on = 'student_id', how = 'outer')
q7

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton    200.0               NaN      NaN
1         S2      Ryder Storey    210.0               NaN      NaN
2         S3      Bryce Jensen    190.0               NaN      NaN
3         S4         Ed Bernal    222.0  Scarlette Fisher    201.0
4         S5       Kwame Morin    199.0  Carla Williamson    200.0
5         S6               NaN      NaN       Dante Morse    198.0
6         S7               NaN      NaN    Kaiser William    219.0
7         S8               NaN      NaN   Madeeha Preston    201.0

### Q:  join (left join) the two dataframes using keys from left dataframe only.
data1:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
data2:
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

In [14]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})

In [20]:
q8 = pd.merge(data1, data2, how = 'left', on= ['key1', 'key2'])
q8_2 = pd.merge( data2, data1, how = 'left', on= ['key1', 'key2'])
q8

  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

In [ ]:
### Q:  join two dataframes using keys from right dataframe only

In [16]:
q9 = pd.merge(data1, data2, how='right', on=['key1', 'key2'])
q9

  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

In [ ]:
### Q:merge two given datasets using multiple join keys

In [18]:
q10 = pd.merge(data1, data2, on = ['key1', 'key2'])
q10

  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

In [22]:
q10_same = pd.merge(data1, data2, on = ['key1', 'key2'], how='inner')
q10_same

  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

In [ ]:
### Q: existing series, using specified argument and override the existing columns names

In [25]:
s1 = pd.Series([0, 1, 2, 3], name='col1')
s2 = pd.Series([0, 1, 2, 3])
s3 = pd.Series([0, 1, 4, 5], name='col3')

In [28]:
q11 = pd.concat([s1, s2, s3], axis = 1, keys = ['col1', 'col2', 'col3'])
q11

   col1  col2  col3
0     0     0     0
1     1     1     1
2     2     2     4
3     3     3     5

In [ ]:
### Q: create a combination from two dataframes where a column id combination appears more than once in both dataframes

In [35]:
table = pd.merge(data1, data2, on = ['key1', 'key2'], how = 'outer')
table

  key1 key2    P    Q    R    S
0   K0   K0   P0   Q0   R0   S0
1   K0   K1   P1   Q1  NaN  NaN
2   K1   K0   P2   Q2   R1   S1
3   K1   K0   P2   Q2   R2   S2
4   K2   K1   P3   Q3  NaN  NaN
5   K2   K0  NaN  NaN   R3   S3

In [67]:
# col1 and col2 appears more than twice
q12 = table.duplicated(subset=['key1','key2'], keep=False)
table[q12]

  key1 key2   P   Q   R   S
2   K1   K0  P2  Q2  R1  S1
3   K1   K0  P2  Q2  R2  S2

In [71]:
# col 1 or col 2 appears more than  twice
duplicated_col = table[table['key1'].duplicated() & table['key2'].duplicated()]
duplicated_col

  key1 key2    P    Q   R   S
3   K1   K0   P2   Q2  R2  S2
5   K2   K0  NaN  NaN  R3  S3

### Q: combine the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

d1:
     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
d2:
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [73]:
d1 = pd.DataFrame({ 'A': ['A0', 'A1','A2'], 
                        'B' : ['B0', 'B1', 'B2']}, 
                        index = ['K0', 'K1', 'K2'])
d2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [74]:
# Join
q13 = d1.join(d2)
q13

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [77]:
compare_concat = pd.concat([d1, d2])
compare_concat

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

### Q: Combine two DataFrame objects by filling null values in one DataFrame with non-null values from other DataFrame.
Original DataFrames:
     A  B
0  NaN  3
1  0.0  4
2  NaN  5
   A    B
0  1  3.0
1  1  NaN
2  3  3.0

In [83]:
df1 = pd.DataFrame({'A': [None, 0.0, None], 
                      'B': ['3', '4', '5']})
df2 = pd.DataFrame({ 'A': [1, 1, 3], 
                      'B': [3, None, 3]})
df1

     A  B
0  NaN  3
1  0.0  4
2  NaN  5

In [84]:
q14_1 = df1.combine_first(df2)
q14_1

     A  B
0  1.0  3
1  0.0  4
2  3.0  5

In [85]:
q14_2 = df2.combine_first(df1)
q14_2

     A    B
0  1.0  3.0
1  1.0    4
2  3.0  3.0

In [88]:
x = 345
y = sum(list(map(int, str(x))))
# 12

[3, 4, 5]

2. Pandas Time Series

1). Write a Pandas program to create
a) Datetime object for Jan 15 2012.
b) Specific date and time of 9:20 pm.
c) Local date and time.
d) A date without time.
e) Current date.
f) Time from a datetime.
g) Current local time.

In [94]:
from datetime import datetime
print("Datetime object for Jan 11 2012:")
print(datetime(2012, 1, 11))
print("\nSpecific date and time of 9:20 pm") 
print(datetime(2011, 1, 11, 21, 20))
print("\nLocal date and time:")
print(datetime.now())
print("\nA date without time: ")
print(datetime.date(datetime(2012, 5, 22)))
print("\nCurrent date:")
print(datetime.now().date())
print("\nTime from a datetime:")
print(datetime.time(datetime(2012, 12, 15, 18, 12)))
print("\nCurrent local time:") 
print(datetime.now().time())

Datetime object for Jan 11 2012:
2012-01-11 00:00:00

Specific date and time of 9:20 pm
2011-01-11 21:20:00

Local date and time:
2023-09-22 16:43:18.181859

A date without time:
2012-05-22

Current date:
2023-09-22

Time from a datetime:
18:12:00

Current local time:
16:43:18.182047

2). Write a Pandas program to create
a) a specific date using timestamp.
b) date and time using timestamp.
c) a time adds in the current local date using timestamp.
d) current date and time using timestamp.

In [95]:
import pandas as pd
print("\nA specific date using timestamp:")
print(pd.Timestamp('2016-11-10'))
print("\nDate and time using timestamp:")
print(pd.Timestamp('2012-05-03 11:30'))
print("\nA time adds in the current local date using timestamp:")
print(pd.Timestamp('11:30'))
print("\nCurrent date and time using timestamp:")
print(pd.Timestamp("now"))

A specific date using timestamp:
2016-11-10 00:00:00

Date and time using timestamp:
2012-05-03 11:30:00

A time adds in the current local date using timestamp:
2023-09-22 11:30:00

Current date and time using timestamp:
2023-09-22 16:44:20.797883

3). create a date from a given year, month, day and another date from a given string formats

In [96]:
from datetime import datetime
date1 = datetime(year=2020, month=12, day=25)
print("Date from a given year, month, day:")
print(date1)
from dateutil import parser
date2 = parser.parse("1st of January, 2021")
print("\nDate from a given string formats:")
print(date2)

Date from a given year, month, day:
2020-12-25 00:00:00

Date from a given string formats:
2021-01-01 00:00:00

4). print the day after and before a specified date. Also print the days between two given dates

In [97]:
import pandas as pd
import datetime
from datetime import datetime, date
today = datetime(2012, 10, 30)
print("Current date:", today)
tomorrow = today + pd.Timedelta(days=1)
print("Tomorrow:", tomorrow)
yesterday = today - pd.Timedelta(days=1)
print("Yesterday:", yesterday)
date1 = datetime(2016, 8, 2)
date2 = datetime(2016, 7, 19)
print("\nDifference between two dates: ",(date1 - date2))

Current date: 2012-10-30 00:00:00
Tomorrow: 2012-10-31 00:00:00
Yesterday: 2012-10-29 00:00:00

Difference between two dates:  14 days, 0:00:00

3. Filter
### select first 2 rows, 2 columns and specific two columns

In [100]:
import pandas as pd

df = pd.read_csv('world_alcohol.csv')

In [102]:
row_2= df.iloc[:2]
row_2

   Year       WHO region   Country Beverage Types  Display Value
0  1986  Western Pacific  Viet Nam           Wine            0.0
1  1986         Americas   Uruguay          Other            0.5

In [110]:
col_2 = df.iloc[:, :2]
col_2

      Year       WHO region
0     1986  Western Pacific
1     1986         Americas
2     1985           Africa
3     1986         Americas
4     1987         Americas
...    ...              ...
3252  1984           Africa
3253  1986  Western Pacific
3254  1986           Europe
3255  1987  Western Pacific
3256  1986           Africa

[3257 rows x 2 columns]

In [111]:
first_col = df[['Display Value', 'Year']]
first_col

      Display Value  Year
0              0.00  1986
1              0.50  1986
2              1.62  1985
3              4.27  1986
4              1.98  1987
...             ...   ...
3252           0.46  1984
3253           0.05  1986
3254           2.54  1986
3255           0.00  1987
3256           5.15  1986

[3257 rows x 2 columns]

In [ ]:
### Q:select random number of rows, fraction of random rows from World alcohol consumption dataset

In [112]:
df.sample(5)

,Year,WHO region,Country,Beverage Types,Display Value
2024,1985,Africa,Equatorial Guinea,Spirits,0.00
124,1985,Europe,Hungary,Spirits,7.01
575,1987,Eastern Mediterranean,Yemen,Other,NaN
1977,1987,Western Pacific,Malaysia,Other,NaN
9,1984,Africa,Nigeria,Other,6.10

In [113]:
df.sample(frac = 0.02)

,Year,WHO region,Country,Beverage Types,Display Value
558,1986,Americas,Honduras,Wine,0.02
711,1989,Eastern Mediterranean,Pakistan,Spirits,0.00
2359,1989,Eastern Mediterranean,Kuwait,Other,NaN
1095,1987,South-East Asia,Bhutan,Beer,0.46
2749,1984,Eastern Mediterranean,Morocco,Other,0.00
...,...,...,...,...,...
2164,1989,Europe,United Kingdom of Great Britain and Northern I...,Spirits,2.18
1660,1984,Africa,Gambia,Wine,0.14
1357,1986,Africa,Congo,Beer,2.33
3158,1987,Americas,Chile,Wine,5.41
466,1984,Africa,Mozambique,Wine,0.01

In [ ]:
### Q:  find and drop the missing values

In [ ]:
df.isnull()
df.dropna()

In [ ]:
### Q:remove the duplicates from 'WHO region' column

In [115]:
f4 = df.drop_duplicates('WHO region')
f4

    Year             WHO region       Country Beverage Types  Display Value
0   1986        Western Pacific      Viet Nam           Wine           0.00
1   1986               Americas       Uruguay          Other           0.50
2   1985                 Africa  Cte d'Ivoire           Wine           1.62
13  1984  Eastern Mediterranean   Afghanistan          Other           0.00
18  1984                 Europe        Norway        Spirits           1.62
20  1986        South-East Asia       Myanmar           Wine           0.00

In [ ]:
### Q: find out the alcohol consumption of a given year

In [116]:
f5 = df[df['Year'] == 1985]
f5

,Year,WHO region,Country,Beverage Types,Display Value
2,1985,Africa,Cte d'Ivoire,Wine,1.62
7,1985,Africa,Angola,Spirits,0.39
12,1985,Western Pacific,Lao People's Democratic Republic,Beer,0.00
14,1985,Western Pacific,Viet Nam,Spirits,0.05
24,1985,Africa,Comoros,Other,NaN
...,...,...,...,...,...
3197,1985,Africa,Equatorial Guinea,Beer,0.25
3217,1985,Africa,Lesotho,Beer,1.07
3225,1985,Western Pacific,Singapore,Spirits,0.64
3243,1985,Europe,Slovakia,Wine,2.60
3245,1985,South-East Asia,India,Spirits,1.24

In [116]:
### Q: find out the alcohol consumption details in the year '1987' or '1989'

In [125]:

f6 = df[(df['Year']==1987) | (df['Year']==1989)]

f6

,Year,WHO region,Country,Beverage Types,Display Value
4,1987,Americas,Saint Kitts and Nevis,Beer,1.98
5,1987,Americas,Guatemala,Other,0.00
6,1987,Africa,Mauritius,Wine,0.13
10,1987,Africa,Botswana,Wine,0.20
11,1989,Americas,Guatemala,Beer,0.62
...,...,...,...,...,...
3237,1987,Americas,Canada,Other,NaN
3246,1989,Europe,Poland,Beer,2.03
3249,1989,Europe,Turkey,Other,0.00
3250,1987,Europe,Iceland,Other,0.01
3255,1987,Western Pacific,Papua New Guinea,Other,0.00

In [ ]:
### Q: find out the 'WHO region, 'Country', 'Beverage Types' in the year '1986' or '1989' where WHO region is 'Americas' or 'Europe' from the world alcohol consumption dataset

In [132]:
f7 = df[((df['Year'] == 1986) | (df['Year'] == 1989))&((df['WHO region'] == 'Americas')| (df['WHO region'] == 'Europe'))][['WHO region','Country','Beverage Types']].head()


f7.head()

   WHO region              Country Beverage Types
1    Americas              Uruguay          Other
3    Americas             Colombia           Beer
8    Americas  Antigua and Barbuda        Spirits
11   Americas            Guatemala           Beer
21   Americas           Costa Rica        Spirits

In [ ]:
### Q: filter the specified columns and records by range

In [135]:
f8 = df.loc[0:4, ["WHO region", "Beverage Types"]]
f8

        WHO region Beverage Types
0  Western Pacific           Wine
1         Americas          Other
2           Africa           Wine
3         Americas           Beer
4         Americas           Beer

In [137]:
# or consider .iloc
# but index of iloc[:x], x --> x-1
f8 = df.iloc[0:5, [1, 3]]
f8

        WHO region Beverage Types
0  Western Pacific           Wine
1         Americas          Other
2           Africa           Wine
3         Americas           Beer
4         Americas           Beer

In [ ]:
### Q:  filter those records where WHO region contains "Ea"

In [139]:
f9 = df[df['WHO region'].str.contains("Ea")]
f9

,Year,WHO region,Country,Beverage Types,Display Value
13,1984,Eastern Mediterranean,Afghanistan,Other,0.00
20,1986,South-East Asia,Myanmar,Wine,0.00
25,1984,Eastern Mediterranean,Tunisia,Other,0.00
27,1984,Eastern Mediterranean,Bahrain,Beer,2.22
36,1987,Eastern Mediterranean,Egypt,Beer,0.07
...,...,...,...,...,...
3223,1984,South-East Asia,Democratic People's Republic of Korea,Beer,0.37
3231,1989,Eastern Mediterranean,Morocco,Spirits,0.07
3241,1984,Eastern Mediterranean,Djibouti,Wine,0.51
3244,1986,Eastern Mediterranean,United Arab Emirates,Other,0.00
3245,1985,South-East Asia,India,Spirits,1.24

In [ ]:
### Q: filter records where WHO region is in Africa, Eastern Mediterranean, Europe

In [145]:
f10 = df[df['WHO region'].isin(['Africa', 'Eastern Mediterranean', 'Europe'])]
f10

      Year WHO region                   Country Beverage Types  Display Value
2     1985     Africa              Cte d'Ivoire           Wine           1.62
6     1987     Africa                 Mauritius           Wine           0.13
7     1985     Africa                    Angola        Spirits           0.39
9     1984     Africa                   Nigeria          Other           6.10
10    1987     Africa                  Botswana           Wine           0.20
...    ...        ...                       ...            ...            ...
3250  1987     Europe                   Iceland          Other           0.01
3251  1984     Africa                    Angola           Wine           0.57
3252  1984     Africa  Central African Republic           Wine           0.46
3254  1986     Europe               Switzerland        Spirits           2.54
3256  1986     Africa                 Swaziland          Other           5.15

[2059 rows x 5 columns]

In [ ]:
### Q:  filter those records which not appears in a given list

In [147]:
who_region = ["Africa", "Eastern Mediterranean", "Europe"]
f11 =  df[~df["WHO region"].isin(who_region)]
f11

,Year,WHO region,Country,Beverage Types,Display Value
0,1986,Western Pacific,Viet Nam,Wine,0.00
1,1986,Americas,Uruguay,Other,0.50
3,1986,Americas,Colombia,Beer,4.27
4,1987,Americas,Saint Kitts and Nevis,Beer,1.98
5,1987,Americas,Guatemala,Other,0.00
...,...,...,...,...,...
3238,1984,Western Pacific,Fiji,Wine,0.13
3239,1986,Western Pacific,Viet Nam,Spirits,0.05
3245,1985,South-East Asia,India,Spirits,1.24
3253,1986,Western Pacific,Fiji,Spirits,0.05
3255,1987,Western Pacific,Papua New Guinea,Other,0.00

In [ ]:
### Q: filter all records where the average consumption of beverages per person from .5 to 2.50

In [150]:
f12 = df[(df['Display Value']> 0.5)&(df['Display Value']<2.5)]
f12

,Year,WHO region,Country,Beverage Types,Display Value
2,1985,Africa,Cte d'Ivoire,Wine,1.62
4,1987,Americas,Saint Kitts and Nevis,Beer,1.98
8,1986,Americas,Antigua and Barbuda,Spirits,1.55
11,1989,Americas,Guatemala,Beer,0.62
17,1989,Africa,Seychelles,Beer,2.23
...,...,...,...,...,...
3236,1986,Africa,Seychelles,Beer,2.16
3241,1984,Eastern Mediterranean,Djibouti,Wine,0.51
3245,1985,South-East Asia,India,Spirits,1.24
3246,1989,Europe,Poland,Beer,2.03
3251,1984,Africa,Angola,Wine,0.57

In [ ]:
### Q: filter rows based on row numbers ended with 0, like 0, 10, 20, 30

In [151]:
f13 = df.filter(regex='0$', axis=0)
f13

      Year             WHO region       Country Beverage Types  Display Value
0     1986        Western Pacific      Viet Nam           Wine           0.00
10    1987                 Africa      Botswana           Wine           0.20
20    1986        South-East Asia       Myanmar           Wine           0.00
30    1986                 Africa  Sierra Leone          Other           4.48
40    1987                 Europe       Austria        Spirits           1.90
...    ...                    ...           ...            ...            ...
3210  1986  Eastern Mediterranean      Djibouti          Other           0.00
3220  1986                 Africa      Zimbabwe        Spirits           5.57
3230  1987                 Europe        France        Spirits           2.77
3240  1986                 Europe      Slovenia           Beer           3.71
3250  1987                 Europe       Iceland          Other           0.01

[326 rows x 5 columns]

### Q: select consecutive columns and also select rows with Index label 0 to 9

In [ ]:
f14 =

In [ ]:
# Rank

176. Second Hignest Salary
+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.

Write a solution to find the second highest salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
Output: 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+

Approach:
* Drop Duplicates and Get Unique Salaries: Use drop_duplicates() function on the 'salary' column to get unique salary values.

* Sort Salaries in Descending Order: Sort it with sort_values(ascending=False) in descending order.

* Retrieve the Salary: Check if the unique salaries contain at least two values (length >= 2). If it does, then the second highest salary exists, and we can retrieve it using .iloc[-1], if not, return 'None'. 

* Return the Result: Create a new DataFrame with value under the column 'SecondHighestSalary'.

In [ ]:
import pandas as pd

def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
  salaries = employee['salary'].drop_duplicates().sort_values(ascending = False)
  print(salaries)
  if len(salaries) < 2:
      return pd.DataFrame({'SecondHighestSalary': [None]})
  second_highest = salaries.iloc[1]
  return pd.DataFrame({'SecondHighestSalary': [second_highest]})

### Additional reference
177. Nth Hignest Salary
Approach:
* Drop Duplicates and Get Unique Salaries: Use drop_duplicates() function on the 'salary' column to get unique salary values.

* Sort Salaries in Descending Order: Sort it with sort_values(ascending=False) in descending order.

* Retrieve the Salary: Check if the unique salaries contain at least two values (length >= N). If it does, then the Nth highest salary exists, and we can retrieve it using .iloc[N-1], if not, return 'None'. 

* Return the Result: Create a new DataFrame with value under the column 'getNthHighestSalary(n)'.

In [152]:
import pandas as pd

def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
  salaries = employee['salary'].drop_duplicates().sort_values(ascending = False)
  if len(salaries) < N:
      return pd.DataFrame({f'getNthHighestSalary({N})': [None]})
  N_highest = employee['salary'].iloc[N-1]
  return pd.DataFrame({f'getNthHighestSalary({N})': [N_highest]})

SyntaxError: incomplete input (1327182483.py, line 5)

178. Rank scores
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| score       | decimal |
+-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table contains the score of a game. Score is a floating point value with two decimal places.
 
Write a solution to find the rank of the scores. The ranking should be calculated according to the following rules:

The scores should be ranked from the highest to the lowest.
If there is a tie between two scores, both should have the same ranking.
After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.
Return the result table ordered by score in descending order.

Example 1:

Input: 
Scores table:
+----+-------+
| id | score |
+----+-------+
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |
| 6  | 3.65  |
+----+-------+
Output: 
+-------+------+
| score | rank |
+-------+------+
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
| 3.65  | 3    |
| 3.65  | 3    |
| 3.50  | 4    |
+-------+------+

Approach:
* Sort scores in Descending Order by 'score'
* Rank the scores with dense rank
* Return the result

In [ ]:
import pandas as pd

def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    sorted_score = scores.sort_values(by = 'score', ascending=False)
    sorted_score['rank'] = (sorted_score['score'].rank(method = 'dense', ascending = False))
    return sorted_score[['score', 'rank']]

180. Consecutive Number
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| num         | varchar |
+-------------+---------+
In SQL, id is the primary key for this table.
id is an autoincrement column.

Find all numbers that appear at least three times consecutively.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Logs table:
+----+-----+
| id | num |
+----+-----+
| 1  | 1   |
| 2  | 1   |
| 3  | 1   |
| 4  | 2   |
| 5  | 1   |
| 6  | 2   |
| 7  | 2   |
+----+-----+
Output: 
+-----------------+
| ConsecutiveNums |
+-----------------+
| 1               |
+-----------------+
Explanation: 1 is the only number that appears consecutively for at least three times.

Approach:
* rolling window and set the flag: rolling window .rolling(window = n) within 3 steps constrained to unique() if the consecutive numbers exist
* if flag, return the num without duplicates

**Note: x.nunique(): number of unique keys; x.unique(): unique keys**

In [ ]:
def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
  logs['flags'] = logs['num'].rolling(window = 3).apply(lambda x: x.nunique()==1)
  logs_flag = logs[logs['flags']==1][['num']].drop_duplicates()['num']
  return pd.DataFrame({'ConsecutiveNums': logs_flag})

184. Departmet highest salary
Table: Employee

+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |
+--------------+---------+
id is the primary key (column with unique values) for this table.
departmentId is a foreign key (reference columns) of the ID from the Department table.
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.
 

Table: Department

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
id is the primary key (column with unique values) for this table. It is guaranteed that department name is not NULL.
Each row of this table indicates the ID of a department and its name.
 

Write a solution to find employees who have the highest salary in each of the departments.

Return the result table in any order.

Input: 
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+
Output: 
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Jim      | 90000  |
| Sales      | Henry    | 80000  |
| IT         | Max      | 90000  |
+------------+----------+--------+
Explanation: Max and Jim both have the highest salary in the IT department and Henry has the highest salary in the Sales department.

Approach: 
* Merge two tables: .merge(table1, table2, left_on = 'left_key', right_on = 'right_key', how = 'merge_method')
* Aggregate the group: .group_by('expected_group') to aggregate the group
* Select the highest salary:.apply(lambda x: x[x.salary == x.salary.max()])
* Arrange the merged table to the expected format: .rename(columns ={' ' : ' '}), .drop([' ', ' ']).reset_index()

In [ ]:
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(employee, department, left_on = 'departmentId', right_id = 'id')
    df = df.grouby('name_y').apply(lambda x: x[x.salary ==x.salary.max()])
    df = df.rename(columns = {'name_y': 'Department', 'name_x': 'Employee'})
    df = df.drop(columns=['id_x', 'id_y'])
    result = df[['Department', 'Employee', 'salary']]
    return result

550. Game player analysis 
551. Table: Activity

+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key (combination of columns with unique values) of this table.
This table shows the activity of players of some games.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on someday using some device.
 

Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. In other words, you need to count the number of players that logged in for at least two consecutive days starting from their first login date, then divide that number by the total number of players.

The result format is in the following example.

 

Example 1:

Input: 
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+
Output: 
+-----------+
| fraction  |
+-----------+
| 0.33      |
+-----------+
Explanation: 
Only the player with id 1 logged back in after the first day he had logged in so the answer is 1/3 = 0.33

Approach:
* Group by the layer's record for login day : .groupby('') for grouping by the players' records, .transformer(lambda) to apply the lambda to the values
* find if the login date is event_date (consecutive time)
* return the result, with the number of consecutive days players

In [2]:
import pandas as pd
df = pd.DataFrame({
    'A': [pd.to_datetime('2020-01-01'),
          pd.to_datetime('2020-01-01'),
          pd.to_datetime('2020-01-02'),],
    'B': [1, 2, 3], },
    index=pd.date_range('2020', periods=3))
df.rolling('2D', on='A').sum()

                    A    B
2020-01-01 2020-01-01  1.0
2020-01-02 2020-01-01  3.0
2020-01-03 2020-01-02  6.0